app/views/users/show.html.erb

SELECT "games".* FROM "games" WHERE "games"."user_id" = $1  [["user_id", 2]]
SELECT COUNT(*) FROM "games" WHERE "games"."user_id" = $1  [["user_id", 2]]
---
          <tr>
            <td><%= current_user.games.count %></td>