app/controllers/games_controller.rb

INSERT INTO "games" ("user_id", "board", "outcome", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["board", "---------"], ["outcome", 1], ["created_at", 2016-11-01 16:35:12 UTC], ["updated_at", 2016-11-01 16:35:12 UTC]]
---
  def new
    game = Game.create(board:"---------",
                user_id: set_user.id,
                outcome: 2
                )

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def show
    # game_owner_id = Game.find_by(id: params[:id]).user_id
    # redirect_to root_path if !session[:user_id] || game_owner_id != session[:user_id]
    game = Game.find_by(id: params[:id])

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "games" SET "time_played" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["time_played", #<BigDecimal:7ff71d4e6ee0,'0.202E-2',9(36)>], ["updated_at", 2016-11-02 02:39:21 UTC], ["id", 8]]
---
  def update
    game = Game.find_by(id: session[:game_id])
      idx = params[:game][:id].to_i
      new_board = game.update_board(idx)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_user
    User.find_by(id: session[:user_id]) || User.find_by(id: 1)