app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Well"], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "games" SET "user_id" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["user_id", 2], ["updated_at", 2016-11-02 16:32:18 UTC], ["id", 13]]
---
  def create
    user = User.find_by(username: params[:user][:username])
    if user && user.authenticate(params[:user][:password])
      session[:user_id] = user.id
      if session[:game_id]
        Game.find_by(id: session[:game_id]).update(user_id: user.id)