app/controllers/users_controller.rb

  def show
    if session[:user_id] == params[:id]
      @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    user = User.new(user_params)
    if user.save
      session[:user_id] = user.id
      if session[:game_id]
        Game.find_by(id: session[:game_id]).update(user_id: user.id)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "user"], ["password_digest", "$2a$10$B1XE8ewlN5o3537vuHOTJ.f2ALLC8zU8aEr3kY6p2dbEnEjBnQaaa"], ["created_at", 2016-11-02 02:26:41 UTC], ["updated_at", 2016-11-02 02:26:41 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]